
from pages.webs.web.webs_basepage import BasePage
class LotteryList(BasePage):

    def lotterylist(self):
        hk ={
            '六合彩':['香港六合彩'],
        }

        lottery_list ={
            '六合彩':["澳门分分彩", "澳门三分彩", "澳门五分彩", '分分六合彩', '三分六合彩', '极速六合彩', '香港六合彩', '新澳门六合彩', '澳门六合彩'],
            '时时彩':['极速时时彩', '五分时时彩', '澳洲幸运5'],
            'pk拾(幸运飞艇)':['极速pk拾', '五分pk拾', '澳洲幸运10', '幸运飞艇'],
            'PC蛋蛋(幸运28)':['PC蛋蛋', '加拿大幸运28', '台湾幸运28', '五分幸运28'],
            '11选5':['极速11选5', '三分11选5', '五分11选5'],
            '快3':['极速快3', '三分快3', '五分快3'],
            '一般彩票':['福彩3D', '排列三'],
        }

        return lottery_list, hk

    def hk(self, brand):
        if brand == 'ls':
            handicap ={
                '特码':['号码', '两面', '特肖', '合肖', '头数', '尾数', '五行'],
                '正码特':[['正码特一', '正码特二', '正码特三', '正码特四', '正码特五', '正码特六'] ,['-号码', '-两面', '-色波']],
            }
        else:
            handicap ={
                '特码-A盘':['号码', '两面', '特肖', '合肖', '头数', '尾数', '五行'],
                '特码-B盘':['号码'],
                '特码-C盘':['号码'],
                '正码特-A盘':[['正码特一', '正码特二', '正码特三', '正码特四', '正码特五', '正码特六'] ,['-号码', '-两面', '-色波']],
                '正码特-B盘':['正码特一-号码', '正码特二-号码', '正码特三-号码', '正码特四-号码', '正码特五-号码', '正码特六-号码'],
                '正码特-C盘':['正码特一-号码', '正码特二-号码', '正码特三-号码', '正码特四-号码', '正码特五-号码', '正码特六-号码'],
            }

        hk ={
            '正码':['号码', '总和', '正肖', '总肖'],
            '平特肖尾':['一尾', '一肖'],
            '连肖连尾':['二尾碰', '三尾碰', '四尾碰', '五尾碰', '二肖连', '三肖连', '四肖连', '五肖连'],
            '连码':[['特串', '二中特', '二全中', '三中二', '三全中', '四全中'], ['普通复式', '胆拖号码', '胆拖生肖', '胆拖尾数', '胆拖色波']],
            '不中':['五不中', '六不中', '七不中', '八不中', '九不中', '十不中', '十一不中', '十二不中'],
            '色波':['色波', '半波', '半半波', '七色波'],
            '中一':['五中一', '六中一', '七中一', '八中一', '九中一', '十中一'],
        }

        handicap.update(hk)

        return handicap

    def marksix(self):
        marksix ={
            '特码':['号码', '两面', '特肖', '合肖', '头数', '尾数', '五行'],
            '正码特':[['正码特一', '正码特二', '正码特三', '正码特四', '正码特五', '正码特六'] ,['-号码', '-两面', '-色波']],
            '正码':['号码', '总和', '正肖', '总肖'],
            '平特肖尾':['一尾', '一肖'],
            '连肖连尾':['二尾碰', '三尾碰', '四尾碰', '五尾碰', '二肖连', '三肖连', '四肖连', '五肖连'],
            '连码':[['特串', '二中特', '二全中', '三中二', '三全中', '四全中'], ['普通复式', '胆拖号码', '胆拖生肖', '胆拖尾数', '胆拖色波']],
            '不中':['五不中', '六不中', '七不中', '八不中', '九不中', '十不中', '十一不中', '十二不中'],
            '色波':['色波', '半波', '半半波', '七色波'],
            '中一':['五中一', '六中一', '七中一', '八中一', '九中一', '十中一'],
        }

        return marksix


    def ss(self): 
        ss ={
            '两面':['万千百十个', '总和', '龙虎和'],
            '一字定位':['万', '千', '百', '个', '十'],
            '二字定位':['万千', '万百', '万十', '万个', '千百', '千十', '千个', '百十', '百个', '十个'],
            '三字定位': ['前三', '中三', '后三'],
            '五字定位': ['只有一种'],
            '任选一': ['全五', '前三', '中三', '后三'],
            '和数': ['五字', '前三', '中三', '后三', '万千', '万百', '万十', '万个', '千百' , '千十', '千个', '百十', '百个', '十个'],
            '组选三': ['前三', '中三', '后三'],
            '组选六': ['前三', '中三', '后三'],
            '和尾数': ['五字', '前三', '中三', '后三', '万千', '万百', '万十', '万个', '千百' , '千十', '千个', '百十', '百个', '十个'],
            '跨度': ['前三', '中三', '后三'],
            '特殊玩法': ['前三', '中三', '后三'],
        }

        return ss

    def pk(self): 
        pk ={
            '号码':['1-5', '6-10'],
            '冠亚和':['号码', '两面'],
            '龙虎':['只有一种'],
        }

        return pk

    def pcegg(self): 
        pcegg ={
            '两面':['只有一种'],
            '色波':['只有一种'],
            '特殊':['只有一种'],
            '特码':['号码', '包三'],
        }
        
        return pcegg

    def to115(self): 
        to115 ={
            '总和':['只有一种'],
            '两面':['第一球', '第二球', '第三球', '第四球', '第五球'],
            '单码':['第一球', '第二球', '第三球', '第四球', '第五球'],
            '任选':['一中一', '二中二', '三中三', '四中四', '五中五', '六中五', '七中五', '八中五'],
            '组选':['前二', '前三'],
            '直选':['前二', '前三'],
        }

        return to115

    def k3(self):   
        k3 ={
            '两面':['只有一种'],
            '点数':['只有一种'],
            '三军':['只有一种'],
            '围骰/全骰':['只有一种'],
            '长牌':['只有一种'],
            '短牌':['只有一种'],
        }

        return k3

    def normal(self):   
        normal ={
            '一字定位':['百', '十', '个'],
            '组选':['二星组选', '三星组选三', '三星组选六'],
            '字串关':['只有一种'],
            '和值':['两面', '号码'],
            '和尾数':['只有一种'],
            '跨度':['只有一种'],
            '龙虎和':['只有一种'],
            '特殊玩法':['只有一种'],
        }

        return normal